#ifndef H_Bridge_h
#define H_Bridge_h

#include "stm32f10x.h"

//APIs

/*******************************************************************/
//必须: H桥初始化函数:
//参数:
//  无
//
//作用:
//  初始化定时器及其引脚
//
//备注:
//  D0 -> TIM3_Channel1 -> B6
//	D1 -> TIM3_Channel2 -> B7
//	D2 -> TIM3_Channel3 -> B8
//	D4 -> TIM3_Channel4 -> B9
/*******************************************************************/
void H_BridegInit(void);

/*******************************************************************/
//H桥输出控制函数:
//参数:
//  int16_t value; 有效值:-1000 ~ 1000
//
//作用:
//  输出PWM值
/*******************************************************************/
void SetChannel0Value(int16_t value);

void SetChannel1Value(int16_t value);

/*******************************************************************/
//H桥刹车函数:
//参数:
//  void
//
//作用:
//  刹车
/*******************************************************************/
void Brake(void);

#endif
